#### Terraform Format and Style 🖌`success ✅`
#### Terraform Workspace `dev` 🤖 `success ✅`
#### Terraform Plan 📖 `success ✅`
<details><summary>Show Plan 🔎 </summary>

```diff
random_string.bucket_suffix: Refreshing state... [id=j6uac]
null_resource.check_match_workspace_environment: Refreshing state... [id=998740619074043671]
null_resource.validate_workspace: Refreshing state... [id=2548353447211286183]
aws_s3_bucket.this: Refreshing state... [id=my-cd-bucket-dev-j6uac]
aws_sns_topic.this: Refreshing state... [id=arn:aws:sns:us-west-2:808625618156:dev-user-updates-topic]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
- /+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic.this must be replaced
- /+ resource "aws_sns_topic" "this" {
-      - application_success_feedback_sample_rate = 0 -> null
!      ~ arn                                      = "arn:aws:sns:us-west-2:808625618156:dev-user-updates-topic" -> (known after apply)
+      + beginning_archive_time                   = (known after apply)
-      - firehose_success_feedback_sample_rate    = 0 -> null
-      - http_success_feedback_sample_rate        = 0 -> null
!      ~ id                                       = "arn:aws:sns:us-west-2:808625618156:dev-user-updates-topic" -> (known after apply)
-      - lambda_success_feedback_sample_rate      = 0 -> null
!      ~ name                                     = "dev-user-updates-topic" -> "dev-user-updates-topic-auto-merge" # forces replacement
+      + name_prefix                              = (known after apply)
!      ~ owner                                    = "808625618156" -> (known after apply)
!      ~ policy                                   = jsonencode(
            {
-              - Id        = "__default_policy_ID"
-              - Statement = [
-                  - {
-                      - Action    = [
-                          - "SNS:GetTopicAttributes",
-                          - "SNS:SetTopicAttributes",
-                          - "SNS:AddPermission",
-                          - "SNS:RemovePermission",
-                          - "SNS:DeleteTopic",
-                          - "SNS:Subscribe",
-                          - "SNS:ListSubscriptionsByTopic",
-                          - "SNS:Publish",
                        ]
-                      - Condition = {
-                          - StringEquals = {
-                              - "AWS:SourceOwner" = "808625618156"
                            }
                        }
-                      - Effect    = "Allow"
-                      - Principal = {
-                          - AWS = "*"
                        }
-                      - Resource  = "arn:aws:sns:us-west-2:808625618156:dev-user-updates-topic"
-                      - Sid       = "__default_statement_ID"
                    },
                ]
-              - Version   = "2008-10-17"
            }
        ) -> (known after apply)
!      ~ signature_version                        = 0 -> (known after apply)
-      - sqs_success_feedback_sample_rate         = 0 -> null
-      - tags                                     = {} -> null
+      + tracing_config                           = (known after apply)
        # (17 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: planfile

To perform exactly these actions, run the following command to apply:
    terraform apply "planfile"

```

</details>



*Pusher: @davidlimacardoso, Action: `pull_request`*